
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 6 to change, 16 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.queue-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Replace
  * module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/e044ac5a00954075834b3a877353daf9"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/2a56c5dffbb645709957aea9f871190b"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-listen-connection-string/ff12000a26f94f36ba26498d10ca3f33"
        name                    = "update-case-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/b040593be9014a73a2ce06cabec63039"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "lastUpdated"  = "2023-10-04T16:10:25Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue will be destroyed
  # (because azurerm_servicebus_queue.servicebus_queue is not in configuration)
  - resource "azurerm_servicebus_queue" "servicebus_queue" {
      - auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> null
      - dead_lettering_on_message_expiration    = true -> null
      - default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> null
      - duplicate_detection_history_time_window = "PT59M" -> null
      - enable_batched_operations               = true -> null
      - enable_express                          = false -> null
      - enable_partitioning                     = false -> null
      - id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates" -> null
      - lock_duration                           = "PT5M" -> null
      - max_delivery_count                      = 10 -> null
      - max_message_size_in_kilobytes           = 256 -> null
      - max_size_in_megabytes                   = 1024 -> null
      - name                                    = "create-updates" -> null
      - namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat" -> null
      - requires_duplicate_detection            = true -> null
      - requires_session                        = false -> null
      - status                                  = "Active" -> null

      - timeouts {}
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be destroyed
  # (because azurerm_servicebus_queue_authorization_rule.listen_auth_rule is not in configuration)
  - resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> null
      - listen                      = true -> null
      - manage                      = false -> null
      - name                        = "ListenSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = false -> null

      - timeouts {}
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be destroyed
  # (because azurerm_servicebus_queue_authorization_rule.send_auth_rule is not in configuration)
  - resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> null
      - listen                      = false -> null
      - manage                      = false -> null
      - name                        = "SendSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/create-updates" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = true -> null

      - timeouts {}
    }

  # module.ecm-create-updates-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 0 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://ethos-sb-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "ethos-sb-aat"
      ~ sku                                 = "Standard" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = false -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 0 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://ethos-sb-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "ethos-sb-aat"
      ~ sku                                 = "Standard" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = false -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                           = "ethos-shared-aat"
        # (3 unchanged attributes hidden)



      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace will be destroyed
  # (because azurerm_servicebus_namespace.servicebus_namespace is not in configuration)
  - resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      - capacity                            = 0 -> null
      - default_primary_connection_string   = (sensitive value)
      - default_primary_key                 = (sensitive value)
      - default_secondary_connection_string = (sensitive value)
      - default_secondary_key               = (sensitive value)
      - endpoint                            = "https://ethos-servicebus-aat.servicebus.windows.net:443/" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat" -> null
      - local_auth_enabled                  = true -> null
      - location                            = "uksouth" -> null
      - minimum_tls_version                 = "1.0" -> null
      - name                                = "ethos-servicebus-aat" -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "ethos-aat" -> null
      - sku                                 = "Standard" -> null
      - tags                                = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "managedBy"    = "ECM Project"
        } -> null
      - zone_redundant                      = false -> null

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }

      - timeouts {}
    }

  # module.queue-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be destroyed
  # (because azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule is not in configuration)
  - resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey" -> null
      - listen                      = true -> null
      - manage                      = false -> null
      - name                        = "SendAndListenSharedAccessKey" -> null
      - namespace_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = true -> null

      - timeouts {}
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace will be destroyed
  # (because azurerm_servicebus_namespace.servicebus_namespace is not in configuration)
  - resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      - capacity                            = 1 -> null
      - default_primary_connection_string   = (sensitive value)
      - default_primary_key                 = (sensitive value)
      - default_secondary_connection_string = (sensitive value)
      - default_secondary_key               = (sensitive value)
      - endpoint                            = "https://ethos-aat-premium.servicebus.windows.net:443/" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium" -> null
      - local_auth_enabled                  = true -> null
      - location                            = "uksouth" -> null
      - minimum_tls_version                 = "1.0" -> null
      - name                                = "ethos-aat-premium" -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "ethos-aat" -> null
      - sku                                 = "Premium" -> null
      - tags                                = {
          - "application"         = "ethos"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ethos-repl-service"
          - "environment"         = "staging"
          - "managedBy"           = "Ethos Replacement"
        } -> null
      - zone_redundant                      = true -> null

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be destroyed
  # (because azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule is not in configuration)
  - resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      - id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium/authorizationRules/SendAndListenSharedAccessKey" -> null
      - listen                            = true -> null
      - manage                            = false -> null
      - name                              = "SendAndListenSharedAccessKey" -> null
      - namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-aat-premium" -> null
      - primary_connection_string         = (sensitive value)
      - primary_connection_string_alias   = (sensitive value)
      - primary_key                       = (sensitive value)
      - secondary_connection_string       = (sensitive value)
      - secondary_connection_string_alias = (sensitive value)
      - secondary_key                     = (sensitive value)
      - send                              = true -> null
    }

  # module.update-case-queue.azurerm_servicebus_queue.servicebus_queue will be destroyed
  # (because azurerm_servicebus_queue.servicebus_queue is not in configuration)
  - resource "azurerm_servicebus_queue" "servicebus_queue" {
      - auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> null
      - dead_lettering_on_message_expiration    = true -> null
      - default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> null
      - duplicate_detection_history_time_window = "PT59M" -> null
      - enable_batched_operations               = true -> null
      - enable_express                          = false -> null
      - enable_partitioning                     = false -> null
      - id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case" -> null
      - lock_duration                           = "PT5M" -> null
      - max_delivery_count                      = 10 -> null
      - max_message_size_in_kilobytes           = 256 -> null
      - max_size_in_megabytes                   = 1024 -> null
      - name                                    = "update-case" -> null
      - namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat" -> null
      - requires_duplicate_detection            = true -> null
      - requires_session                        = false -> null
      - status                                  = "Active" -> null

      - timeouts {}
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be destroyed
  # (because azurerm_servicebus_queue_authorization_rule.listen_auth_rule is not in configuration)
  - resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> null
      - listen                      = true -> null
      - manage                      = false -> null
      - name                        = "ListenSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = false -> null

      - timeouts {}
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be destroyed
  # (because azurerm_servicebus_queue_authorization_rule.send_auth_rule is not in configuration)
  - resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> null
      - listen                      = false -> null
      - manage                      = false -> null
      - name                        = "SendSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat/queues/update-case" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = true -> null

      - timeouts {}
    }

Plan: 6 to add, 6 to change, 16 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                           = "ethos-shared-aat"
        # (3 unchanged attributes hidden)



      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":30,"Program":"tfcmt","SHA1":"","Vars":{}} -->